[{"_path":"/blog/diy_local_seo_guide_for_family_owned_restaurants","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"DIY Local SEO Guide for Family-Owned Restaurants","description":"If you're running a family-owned restaurant, you know how crucial it is to attract local customers. Implementing effective local SEO strategies can significantly enhance your online visibility and bring more diners through your doors. You might be wondering where to start or how to optimize your presence across various platforms. From setting up your Google Business Profile to engaging with your community on social media, there are several steps you can take to boost your local search rankings. But which strategies will make the most impact?","_type":"markdown","_id":"content:blog:DIY_Local_SEO_Guide_for_Family_Owned_Restaurants.md","_source":"content","_file":"blog/DIY_Local_SEO_Guide_for_Family_Owned_Restaurants.md","_stem":"blog/DIY_Local_SEO_Guide_for_Family_Owned_Restaurants","_extension":"md","sitemap":{"loc":"/blog/diy_local_seo_guide_for_family_owned_restaurants"}},{"_path":"/blog/how_to_optimize_google_my_business_listing_for_local_search","_dir":"blog","_draft":false,"_partial":false,"_locale":"","title":"How to Optimize Google My Business Listing for Local Search","description":"It's funny how you might find a local café just down the street that you never knew existed, yet many businesses struggle to be seen in local searches. If you want your Google My Business listing to stand out, you'll need to focus on some essential optimization techniques. From ensuring accuracy in your business details to effectively engaging with customer reviews, there's a lot to reflect upon. The right strategies can greatly improve your visibility, but what exactly should you prioritize to make the biggest impact?","_type":"markdown","_id":"content:blog:How_to_Optimize_Google_My_Business_Listing_for_Local_Search.md","_source":"content","_file":"blog/How_to_Optimize_Google_My_Business_Listing_for_Local_Search.md","_stem":"blog/How_to_Optimize_Google_My_Business_Listing_for_Local_Search","_extension":"md","sitemap":{"loc":"/blog/how_to_optimize_google_my_business_listing_for_local_search"}}]